terraform plan output under the fold. I seemed to have picked up some climatematch related changes which could either be related to #2757 or just an out-of-date state. I will stash my changes and try a refresh only plan first.

<details> <summary> tf plan output </summary>
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_container_node_pool.dask_worker["worker"] will be updated in-place
  ~ resource "google_container_node_pool" "dask_worker" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/dask-worker"
        name                        = "dask-worker"
      ~ node_locations              = [
          - "us-central1-b",
        ]
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # google_container_node_pool.notebook["climatematch"] will be updated in-place
  ~ resource "google_container_node_pool" "notebook" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-climatematch"
        name                        = "nb-climatematch"
      ~ node_locations              = [
          - "us-central1-b",
        ]
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # google_container_node_pool.notebook["neurohackademy"] will be created
  + resource "google_container_node_pool" "notebook" {
      + cluster                     = "pilot-hubs-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "nb-neurohackademy"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "two-eye-two-see"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 100
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = "pd-balanced"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "2i2c.org/community"           = "neurohackademy"
              + "hub.jupyter.org/node-purpose" = "user"
              + "k8s.dask.org/node-purpose"    = "scheduler"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-highmem-n16"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = "pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com"
          + spot              = false
          + tags              = []
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "hub.jupyter.org_dedicated"
                  + value  = "user"
                },
            ]

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

  # google_container_node_pool.notebook["user"] will be updated in-place
  ~ resource "google_container_node_pool" "notebook" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-user"
        name                        = "nb-user"
      ~ node_locations              = [
          - "us-central1-b",
        ]
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ regular_channel_latest_k8s_versions = {
      ~ "1."    = "1.26.3-gke.1000" -> "1.27.2-gke.1200"
      ~ "1.22." = "1.22.17-gke.8000" -> "1.22.17-gke.12700"
      ~ "1.23." = "1.23.17-gke.2000" -> "1.23.17-gke.6800"
      ~ "1.24." = "1.24.13-gke.2500" -> "1.24.14-gke.1200"
      ~ "1.25." = "1.25.8-gke.1000" -> "1.25.10-gke.1200"
    }
```
</details>